# 调包演示
import pyfpgrowth
transactions = [[1, 2, 5],
                [2, 4],
                [2, 3],
                [1, 2, 4],
                [1, 3],
                [2, 3],
                [1, 3],
                [1, 2, 3, 5],
                [1, 2, 3]]
 
patterns = pyfpgrowth.find_frequent_patterns(transactions, 2)  # 频数删选  频数大于2
rules = pyfpgrowth.generate_association_rules(patterns, 0.6)  # 置信度(条件概率)删选


print(patterns)
print('===============')
print(rules)
 
'''
返回值:
{频繁项:频数}
{(5,): 2, (1, 5): 2, (2, 5): 2, (1, 2, 5): 2, (4,): 2, (2, 4): 2, (1,): 6, (1, 2): 4, (2, 3): 4, (1, 2, 3): 2, (1, 3): 4, (2,): 7}
===============
{关联组合:置信度_即条件概率}
{(5,): ((1, 2), 1.0), (1, 5): ((2,), 1.0), (2, 5): ((1,), 1.0), (4,): ((2,), 1.0), (1,): ((3,), 0.6666666666666666)}
'''